OpenFOAM/Demo-GAN/LES_co/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       47104;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1024;
        startFace       48128;
    }
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          512;
        startFace       49152;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (0 0 -4);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          512;
        startFace       49664;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (0 0 4);
    }
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          512;
        startFace       50176;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-8 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          512;
        startFace       50688;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (8 0 0);
    }
)

// ************************************************************************* //
