OpenFOAM/Demo-GAN/LES_co/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16384
(
(0.588216 0 0.0268769)
(0.648113 0 0.114222)
(0.570385 0 0.0896617)
(0.564397 0 0.0906963)
(0.609683 0 0.116728)
(0.590436 0 0.0613323)
(0.570669 0 0.007637)
(0.613938 0 -0.0540415)
...
)
;

boundaryField
{
    bottom
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    wallshear 
    {
        type            wallShearStressBC; 
    }
}


// ************************************************************************* //
