OpenFOAM/Demo-GAN/LES_co/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16384
(
(0.125 0.00756331 0.0625)
(0.375 0.00756331 0.0625)
(0.625 0.00756331 0.0625)
(0.875 0.00756331 0.0625)
(1.125 0.00756331 0.0625)
(1.375 0.00756331 0.0625)
(1.625 0.00756331 0.0625)
(1.875 0.00756331 0.0625)
...
)
;

boundaryField
{
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
1024
(
(0.125 0 0.0625)
(0.125 0 0.1875)
(0.125 0 0.3125)
(0.125 0 0.4375)
(0.125 0 0.5625)
(0.125 0 0.6875)
(0.125 0 0.8125)
(0.125 0 0.9375)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
1024
(
(0.125 2 0.0625)
(0.125 2 0.1875)
(0.125 2 0.3125)
(0.125 2 0.4375)
(0.125 2 0.5625)
(0.125 2 0.6875)
(0.125 2 0.8125)
(0.125 2 0.9375)
...
)
;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
