OpenFOAM/Demo-GAN/LES_co/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
0.125
0.375
0.625
0.875
1.125
1.375
1.625
1.875
...
)
;

boundaryField
{
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
0.125
0.125
0.125
0.125
0.125
0.125
0.125
0.125
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
0.125
0.125
0.125
0.125
0.125
0.125
0.125
0.125
...
)
;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
