OpenFOAM/Demo-GAN/LES_co/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16384
(
0.0625
0.0625
0.0625
0.0625
0.0625
0.0625
0.0625
0.0625
...
)
;

boundaryField
{
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
0.0625
0.1875
0.3125
0.4375
0.5625
0.6875
0.8125
0.9375
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
1024
(
0.0625
0.1875
0.3125
0.4375
0.5625
0.6875
0.8125
0.9375
...
)
;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
