OpenFOAM/Demo-GAN/LES_co/0/wallshear
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallshear;
}
dimensions      [0 1 -2 0 0 0 0];
internalField   nonuniform List<vector>
1024
(
(0.0 0.0 0.0)
(0.0 0.0 0.0)
(0.0 0.0 0.0)
(0.0 0.0 0.0)
(0.0 0.0 0.0)
(0.0 0.0 0.0)
(0.0 0.0 0.0)
(0.0 0.0 0.0)
...
(0.0 0.0 0.0)
